Revit 2027 API
BuiltInFailures.SketchFailures.DifferentOffsets Property
 Adjacent slope-defining lines must have identical eave heights; the highlighted lines do not. You can use the Align Eaves tool to have the eaves aligned for you.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DifferentOffsets { get; }
Public Shared ReadOnly Property DifferentOffsets As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DifferentOffsets {
	FailureDefinitionId^ get ();
}
static member DifferentOffsets : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace